node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  device: "/device:CPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
}
node {
  name: "Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 128.0
      }
    }
  }
}
node {
  name: "loss_scale/initial_value"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 128.0
      }
    }
  }
}
node {
  name: "loss_scale"
  op: "VariableV2"
  device: "/device:CPU:0"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "loss_scale/Assign"
  op: "Assign"
  input: "loss_scale"
  input: "loss_scale/initial_value"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@loss_scale"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "loss_scale/read"
  op: "Identity"
  input: "loss_scale"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@loss_scale"
      }
    }
  }
}
node {
  name: "tower_0/v/alexnet_synthetic_inputs/shape"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\200\000\000\000\343\000\000\000\343\000\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "tower_0/v/alexnet_synthetic_inputs/mean"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_HALF
        tensor_shape {
        }
        half_val: 22512
      }
    }
  }
}
node {
  name: "tower_0/v/alexnet_synthetic_inputs/stddev"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_HALF
        tensor_shape {
        }
        half_val: 21376
      }
    }
  }
}
node {
  name: "tower_0/v/alexnet_synthetic_inputs/TruncatedNormal"
  op: "TruncatedNormal"
  input: "tower_0/v/alexnet_synthetic_inputs/shape"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "seed"
    value {
      i: 123
    }
  }
  attr {
    key: "seed2"
    value {
      i: 12
    }
  }
}
node {
  name: "tower_0/v/alexnet_synthetic_inputs/mul"
  op: "Mul"
  input: "tower_0/v/alexnet_synthetic_inputs/TruncatedNormal"
  input: "tower_0/v/alexnet_synthetic_inputs/stddev"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_HALF
    }
  }
}
node {
  name: "tower_0/v/alexnet_synthetic_inputs"
  op: "Add"
  input: "tower_0/v/alexnet_synthetic_inputs/mul"
  input: "tower_0/v/alexnet_synthetic_inputs/mean"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_HALF
    }
  }
}
node {
  name: "tower_0/v/gpu_cached_inputs"
  op: "VariableV2"
  device: "/device:GPU:0"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
        dim {
          size: 227
        }
        dim {
          size: 227
        }
        dim {
          size: 3
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "tower_0/v/gpu_cached_inputs/Assign"
  op: "Assign"
  input: "tower_0/v/gpu_cached_inputs"
  input: "tower_0/v/alexnet_synthetic_inputs"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@tower_0/v/gpu_cached_inputs"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "tower_0/v/gpu_cached_inputs/read"
  op: "Identity"
  input: "tower_0/v/gpu_cached_inputs"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@tower_0/v/gpu_cached_inputs"
      }
    }
  }
}
node {
  name: "tower_0/v/alexnet_synthetic_labels/shape"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 128
      }
    }
  }
}
node {
  name: "tower_0/v/alexnet_synthetic_labels/min"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "tower_0/v/alexnet_synthetic_labels/max"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1000
      }
    }
  }
}
node {
  name: "tower_0/v/alexnet_synthetic_labels"
  op: "RandomUniformInt"
  input: "tower_0/v/alexnet_synthetic_labels/shape"
  input: "tower_0/v/alexnet_synthetic_labels/min"
  input: "tower_0/v/alexnet_synthetic_labels/max"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tout"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "seed"
    value {
      i: 123
    }
  }
  attr {
    key: "seed2"
    value {
      i: 21
    }
  }
}
node {
  name: "tower_0/v/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 128
      }
    }
  }
}
node {
  name: "tower_0/v/Reshape"
  op: "Reshape"
  input: "tower_0/v/alexnet_synthetic_labels"
  input: "tower_0/v/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "v/cg/conv0/conv2d/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv0/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\013\000\000\000\013\000\000\000\003\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "v/cg/conv0/conv2d/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv0/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.02720480039715767
      }
    }
  }
}
node {
  name: "v/cg/conv0/conv2d/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv0/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.02720480039715767
      }
    }
  }
}
node {
  name: "v/cg/conv0/conv2d/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "v/cg/conv0/conv2d/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv0/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 123
    }
  }
  attr {
    key: "seed2"
    value {
      i: 27
    }
  }
}
node {
  name: "v/cg/conv0/conv2d/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "v/cg/conv0/conv2d/kernel/Initializer/random_uniform/max"
  input: "v/cg/conv0/conv2d/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv0/conv2d/kernel"
      }
    }
  }
}
node {
  name: "v/cg/conv0/conv2d/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "v/cg/conv0/conv2d/kernel/Initializer/random_uniform/RandomUniform"
  input: "v/cg/conv0/conv2d/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv0/conv2d/kernel"
      }
    }
  }
}
node {
  name: "v/cg/conv0/conv2d/kernel/Initializer/random_uniform"
  op: "Add"
  input: "v/cg/conv0/conv2d/kernel/Initializer/random_uniform/mul"
  input: "v/cg/conv0/conv2d/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv0/conv2d/kernel"
      }
    }
  }
}
node {
  name: "v/cg/conv0/conv2d/kernel"
  op: "VariableV2"
  device: "/gpu:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv0/conv2d/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 11
        }
        dim {
          size: 11
        }
        dim {
          size: 3
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v/cg/conv0/conv2d/kernel/Assign"
  op: "Assign"
  input: "v/cg/conv0/conv2d/kernel"
  input: "v/cg/conv0/conv2d/kernel/Initializer/random_uniform"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv0/conv2d/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "v/cg/conv0/conv2d/kernel/read"
  op: "Identity"
  input: "v/cg/conv0/conv2d/kernel"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv0/conv2d/kernel"
      }
    }
  }
}
node {
  name: "Cast"
  op: "Cast"
  input: "v/cg/conv0/conv2d/kernel/read"
  device: "/gpu:0"
  attr {
    key: "DstT"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "tower_0/v/cg/conv0/conv2d/dilation_rate"
  op: "Const"
  device: "/gpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "tower_0/v/cg/conv0/conv2d/Conv2D"
  op: "Conv2D"
  input: "tower_0/v/gpu_cached_inputs/read"
  input: "Cast"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 4
        i: 4
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "v/cg/conv0/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv0/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "v/cg/conv0/biases"
  op: "VariableV2"
  device: "/gpu:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv0/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v/cg/conv0/biases/Assign"
  op: "Assign"
  input: "v/cg/conv0/biases"
  input: "v/cg/conv0/biases/Initializer/Const"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv0/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "v/cg/conv0/biases/read"
  op: "Identity"
  input: "v/cg/conv0/biases"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv0/biases"
      }
    }
  }
}
node {
  name: "tower_0/v/cg/conv0/Cast"
  op: "Cast"
  input: "v/cg/conv0/biases/read"
  device: "/gpu:0"
  attr {
    key: "DstT"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "tower_0/v/cg/conv0/BiasAdd"
  op: "BiasAdd"
  input: "tower_0/v/cg/conv0/conv2d/Conv2D"
  input: "tower_0/v/cg/conv0/Cast"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "tower_0/v/cg/conv0/Reshape/shape"
  op: "Const"
  device: "/gpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\200\000\000\0007\000\000\0007\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "tower_0/v/cg/conv0/Reshape"
  op: "Reshape"
  input: "tower_0/v/cg/conv0/BiasAdd"
  input: "tower_0/v/cg/conv0/Reshape/shape"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "tower_0/v/cg/conv0/Relu"
  op: "Relu"
  input: "tower_0/v/cg/conv0/Reshape"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_HALF
    }
  }
}
node {
  name: "tower_0/v/cg/mpool0/MaxPool"
  op: "MaxPool"
  input: "tower_0/v/cg/conv0/Relu"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 3
        i: 3
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "v/cg/conv1/conv2d/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv1/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000@\000\000\000\300\000\000\000"
      }
    }
  }
}
node {
  name: "v/cg/conv1/conv2d/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv1/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.03061862103641033
      }
    }
  }
}
node {
  name: "v/cg/conv1/conv2d/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv1/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.03061862103641033
      }
    }
  }
}
node {
  name: "v/cg/conv1/conv2d/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "v/cg/conv1/conv2d/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv1/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 123
    }
  }
  attr {
    key: "seed2"
    value {
      i: 50
    }
  }
}
node {
  name: "v/cg/conv1/conv2d/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "v/cg/conv1/conv2d/kernel/Initializer/random_uniform/max"
  input: "v/cg/conv1/conv2d/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv1/conv2d/kernel"
      }
    }
  }
}
node {
  name: "v/cg/conv1/conv2d/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "v/cg/conv1/conv2d/kernel/Initializer/random_uniform/RandomUniform"
  input: "v/cg/conv1/conv2d/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv1/conv2d/kernel"
      }
    }
  }
}
node {
  name: "v/cg/conv1/conv2d/kernel/Initializer/random_uniform"
  op: "Add"
  input: "v/cg/conv1/conv2d/kernel/Initializer/random_uniform/mul"
  input: "v/cg/conv1/conv2d/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv1/conv2d/kernel"
      }
    }
  }
}
node {
  name: "v/cg/conv1/conv2d/kernel"
  op: "VariableV2"
  device: "/gpu:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv1/conv2d/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 64
        }
        dim {
          size: 192
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v/cg/conv1/conv2d/kernel/Assign"
  op: "Assign"
  input: "v/cg/conv1/conv2d/kernel"
  input: "v/cg/conv1/conv2d/kernel/Initializer/random_uniform"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv1/conv2d/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "v/cg/conv1/conv2d/kernel/read"
  op: "Identity"
  input: "v/cg/conv1/conv2d/kernel"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv1/conv2d/kernel"
      }
    }
  }
}
node {
  name: "Cast_1"
  op: "Cast"
  input: "v/cg/conv1/conv2d/kernel/read"
  device: "/gpu:0"
  attr {
    key: "DstT"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "tower_0/v/cg/conv1/conv2d/dilation_rate"
  op: "Const"
  device: "/gpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "tower_0/v/cg/conv1/conv2d/Conv2D"
  op: "Conv2D"
  input: "tower_0/v/cg/mpool0/MaxPool"
  input: "Cast_1"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "v/cg/conv1/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv1/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 192
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "v/cg/conv1/biases"
  op: "VariableV2"
  device: "/gpu:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv1/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 192
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v/cg/conv1/biases/Assign"
  op: "Assign"
  input: "v/cg/conv1/biases"
  input: "v/cg/conv1/biases/Initializer/Const"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv1/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "v/cg/conv1/biases/read"
  op: "Identity"
  input: "v/cg/conv1/biases"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv1/biases"
      }
    }
  }
}
node {
  name: "tower_0/v/cg/conv1/Cast"
  op: "Cast"
  input: "v/cg/conv1/biases/read"
  device: "/gpu:0"
  attr {
    key: "DstT"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "tower_0/v/cg/conv1/BiasAdd"
  op: "BiasAdd"
  input: "tower_0/v/cg/conv1/conv2d/Conv2D"
  input: "tower_0/v/cg/conv1/Cast"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "tower_0/v/cg/conv1/Reshape/shape"
  op: "Const"
  device: "/gpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\200\000\000\000\033\000\000\000\033\000\000\000\300\000\000\000"
      }
    }
  }
}
node {
  name: "tower_0/v/cg/conv1/Reshape"
  op: "Reshape"
  input: "tower_0/v/cg/conv1/BiasAdd"
  input: "tower_0/v/cg/conv1/Reshape/shape"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "tower_0/v/cg/conv1/Relu"
  op: "Relu"
  input: "tower_0/v/cg/conv1/Reshape"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_HALF
    }
  }
}
node {
  name: "tower_0/v/cg/mpool1/MaxPool"
  op: "MaxPool"
  input: "tower_0/v/cg/conv1/Relu"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 3
        i: 3
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "v/cg/conv2/conv2d/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv2/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\300\000\000\000\200\001\000\000"
      }
    }
  }
}
node {
  name: "v/cg/conv2/conv2d/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv2/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.034020692110061646
      }
    }
  }
}
node {
  name: "v/cg/conv2/conv2d/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv2/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.034020692110061646
      }
    }
  }
}
node {
  name: "v/cg/conv2/conv2d/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "v/cg/conv2/conv2d/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv2/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 123
    }
  }
  attr {
    key: "seed2"
    value {
      i: 73
    }
  }
}
node {
  name: "v/cg/conv2/conv2d/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "v/cg/conv2/conv2d/kernel/Initializer/random_uniform/max"
  input: "v/cg/conv2/conv2d/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv2/conv2d/kernel"
      }
    }
  }
}
node {
  name: "v/cg/conv2/conv2d/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "v/cg/conv2/conv2d/kernel/Initializer/random_uniform/RandomUniform"
  input: "v/cg/conv2/conv2d/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv2/conv2d/kernel"
      }
    }
  }
}
node {
  name: "v/cg/conv2/conv2d/kernel/Initializer/random_uniform"
  op: "Add"
  input: "v/cg/conv2/conv2d/kernel/Initializer/random_uniform/mul"
  input: "v/cg/conv2/conv2d/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv2/conv2d/kernel"
      }
    }
  }
}
node {
  name: "v/cg/conv2/conv2d/kernel"
  op: "VariableV2"
  device: "/gpu:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv2/conv2d/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 192
        }
        dim {
          size: 384
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v/cg/conv2/conv2d/kernel/Assign"
  op: "Assign"
  input: "v/cg/conv2/conv2d/kernel"
  input: "v/cg/conv2/conv2d/kernel/Initializer/random_uniform"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv2/conv2d/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "v/cg/conv2/conv2d/kernel/read"
  op: "Identity"
  input: "v/cg/conv2/conv2d/kernel"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv2/conv2d/kernel"
      }
    }
  }
}
node {
  name: "Cast_2"
  op: "Cast"
  input: "v/cg/conv2/conv2d/kernel/read"
  device: "/gpu:0"
  attr {
    key: "DstT"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "tower_0/v/cg/conv2/conv2d/dilation_rate"
  op: "Const"
  device: "/gpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "tower_0/v/cg/conv2/conv2d/Conv2D"
  op: "Conv2D"
  input: "tower_0/v/cg/mpool1/MaxPool"
  input: "Cast_2"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "v/cg/conv2/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv2/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 384
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "v/cg/conv2/biases"
  op: "VariableV2"
  device: "/gpu:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv2/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 384
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v/cg/conv2/biases/Assign"
  op: "Assign"
  input: "v/cg/conv2/biases"
  input: "v/cg/conv2/biases/Initializer/Const"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv2/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "v/cg/conv2/biases/read"
  op: "Identity"
  input: "v/cg/conv2/biases"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv2/biases"
      }
    }
  }
}
node {
  name: "tower_0/v/cg/conv2/Cast"
  op: "Cast"
  input: "v/cg/conv2/biases/read"
  device: "/gpu:0"
  attr {
    key: "DstT"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "tower_0/v/cg/conv2/BiasAdd"
  op: "BiasAdd"
  input: "tower_0/v/cg/conv2/conv2d/Conv2D"
  input: "tower_0/v/cg/conv2/Cast"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "tower_0/v/cg/conv2/Reshape/shape"
  op: "Const"
  device: "/gpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\200\000\000\000\r\000\000\000\r\000\000\000\200\001\000\000"
      }
    }
  }
}
node {
  name: "tower_0/v/cg/conv2/Reshape"
  op: "Reshape"
  input: "tower_0/v/cg/conv2/BiasAdd"
  input: "tower_0/v/cg/conv2/Reshape/shape"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "tower_0/v/cg/conv2/Relu"
  op: "Relu"
  input: "tower_0/v/cg/conv2/Reshape"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_HALF
    }
  }
}
node {
  name: "v/cg/conv3/conv2d/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv3/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\200\001\000\000\200\001\000\000"
      }
    }
  }
}
node {
  name: "v/cg/conv3/conv2d/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv3/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.02946278266608715
      }
    }
  }
}
node {
  name: "v/cg/conv3/conv2d/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv3/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.02946278266608715
      }
    }
  }
}
node {
  name: "v/cg/conv3/conv2d/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "v/cg/conv3/conv2d/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv3/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 123
    }
  }
  attr {
    key: "seed2"
    value {
      i: 95
    }
  }
}
node {
  name: "v/cg/conv3/conv2d/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "v/cg/conv3/conv2d/kernel/Initializer/random_uniform/max"
  input: "v/cg/conv3/conv2d/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv3/conv2d/kernel"
      }
    }
  }
}
node {
  name: "v/cg/conv3/conv2d/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "v/cg/conv3/conv2d/kernel/Initializer/random_uniform/RandomUniform"
  input: "v/cg/conv3/conv2d/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv3/conv2d/kernel"
      }
    }
  }
}
node {
  name: "v/cg/conv3/conv2d/kernel/Initializer/random_uniform"
  op: "Add"
  input: "v/cg/conv3/conv2d/kernel/Initializer/random_uniform/mul"
  input: "v/cg/conv3/conv2d/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv3/conv2d/kernel"
      }
    }
  }
}
node {
  name: "v/cg/conv3/conv2d/kernel"
  op: "VariableV2"
  device: "/gpu:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv3/conv2d/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 384
        }
        dim {
          size: 384
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v/cg/conv3/conv2d/kernel/Assign"
  op: "Assign"
  input: "v/cg/conv3/conv2d/kernel"
  input: "v/cg/conv3/conv2d/kernel/Initializer/random_uniform"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv3/conv2d/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "v/cg/conv3/conv2d/kernel/read"
  op: "Identity"
  input: "v/cg/conv3/conv2d/kernel"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv3/conv2d/kernel"
      }
    }
  }
}
node {
  name: "Cast_3"
  op: "Cast"
  input: "v/cg/conv3/conv2d/kernel/read"
  device: "/gpu:0"
  attr {
    key: "DstT"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "tower_0/v/cg/conv3/conv2d/dilation_rate"
  op: "Const"
  device: "/gpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "tower_0/v/cg/conv3/conv2d/Conv2D"
  op: "Conv2D"
  input: "tower_0/v/cg/conv2/Relu"
  input: "Cast_3"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "v/cg/conv3/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv3/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 384
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "v/cg/conv3/biases"
  op: "VariableV2"
  device: "/gpu:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv3/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 384
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v/cg/conv3/biases/Assign"
  op: "Assign"
  input: "v/cg/conv3/biases"
  input: "v/cg/conv3/biases/Initializer/Const"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv3/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "v/cg/conv3/biases/read"
  op: "Identity"
  input: "v/cg/conv3/biases"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv3/biases"
      }
    }
  }
}
node {
  name: "tower_0/v/cg/conv3/Cast"
  op: "Cast"
  input: "v/cg/conv3/biases/read"
  device: "/gpu:0"
  attr {
    key: "DstT"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "tower_0/v/cg/conv3/BiasAdd"
  op: "BiasAdd"
  input: "tower_0/v/cg/conv3/conv2d/Conv2D"
  input: "tower_0/v/cg/conv3/Cast"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "tower_0/v/cg/conv3/Reshape/shape"
  op: "Const"
  device: "/gpu:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\200\000\000\000\r\000\000\000\r\000\000\000\200\001\000\000"
      }
    }
  }
}
node {
  name: "tower_0/v/cg/conv3/Reshape"
  op: "Reshape"
  input: "tower_0/v/cg/conv3/BiasAdd"
  input: "tower_0/v/cg/conv3/Reshape/shape"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_HALF
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "tower_0/v/cg/conv3/Relu"
  op: "Relu"
  input: "tower_0/v/cg/conv3/Reshape"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_HALF
    }
  }
}
node {
  name: "v/cg/conv4/conv2d/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv4/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\200\001\000\000\000\001\000\000"
      }
    }
  }
}
node {
  name: "v/cg/conv4/conv2d/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv4/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.03227486088871956
      }
    }
  }
}
node {
  name: "v/cg/conv4/conv2d/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv4/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.03227486088871956
      }
    }
  }
}
node {
  name: "v/cg/conv4/conv2d/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "v/cg/conv4/conv2d/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv4/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 123
    }
  }
  attr {
    key: "seed2"
    value {
      i: 117
    }
  }
}
node {
  name: "v/cg/conv4/conv2d/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "v/cg/conv4/conv2d/kernel/Initializer/random_uniform/max"
  input: "v/cg/conv4/conv2d/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv4/conv2d/kernel"
      }
    }
  }
}
node {
  name: "v/cg/conv4/conv2d/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "v/cg/conv4/conv2d/kernel/Initializer/random_uniform/RandomUniform"
  input: "v/cg/conv4/conv2d/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv4/conv2d/kernel"
      }
    }
  }
}
node {
  name: "v/cg/conv4/conv2d/kernel/Initializer/random_uniform"
  op: "Add"
  input: "v/cg/conv4/conv2d/kernel/Initializer/random_uniform/mul"
  input: "v/cg/conv4/conv2d/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv4/conv2d/kernel"
      }
    }
  }
}
node {
  name: "v/cg/conv4/conv2d/kernel"
  op: "VariableV2"
  device: "/gpu:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv4/conv2d/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 384
        }
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v/cg/conv4/conv2d/kernel/Assign"
  op: "Assign"
  input: "v/cg/conv4/conv2d/kernel"
  input: "v/cg/conv4/conv2d/kernel/Initializer/random_uniform"
  device: "/gpu:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v/cg/conv4/conv2d/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
